solvers/freeFallingPimpleFoam/tutorials/RODSFROMGOD/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-18 -18 -36) //0
    ( 18 -18 -36) //1
    ( 18  18 -36) //2
    (-18  18 -36) //3

    (-18 -18  36) //4
    ( 18 -18  36) //5
    ( 18  18  36) //6
    (-18  18  36) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (180 180 360)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xmin
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    xmax
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ymin
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    ymax
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }

    zmin
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    zmax
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);
